from django.shortcuts import render

products_list = [
    {
        "id": 1,
        "name": "Піца Маргарита",
        "description": "Класична італійська піца з томатним соусом, моцарелою і базиліком.",
        "price": 150,
    },
    {
        "id": 2,
        "name": "Паста Карбонара",
        "description": "Спагетті з соусом Карбонара: бекон, вершки, яйця та сир Пармезан.",
        "price": 120,
    },
    {
        "id": 3,
        "name": "Салат Цезар з куркою",
        "description": "Салат з курячим філе, листовим салатом, грінками, пармезаном і соусом Цезар.",
        "price": 90,
    },
    {
        "id": 4,
        "name": "Суп Мінестроне",
        "description": "Італійський суп з багатою різними овочами та макаронами.",
        "price": 80,
    },
    {
        "id": 5,
        "name": "Тірамісу",
        "description": "Класичний італійський десерт з маскарпоне, кавою та ладшими бісквітами.",
        "price": 60,
    },
    {
        "id": 6,
        "name": "Піца з грибами",
        "description": "Піца з томатним соусом, моцарелою та шампіньонами.",
        "price": 160,
    },
    {
        "id": 7,
        "name": "Різотто з креветками",
        "description": "Італійський рис з креветками, часником, петрушкою і лимонним соком.",
        "price": 130,
    },
    {
        "id": 8,
        "name": "Фетучіні Альфредо",
        "description": "Фетучіні з соусом Альфредо: вершки, сир Пармезан, часник і масло.",
        "price": 110,
    },
    {
        "id": 9,
        "name": "Салат з авокадо",
        "description": "Салат з авокадо, помідорами, моцарелою, базиліком і оливковою олією.",
        "price": 100,
    },
    {
        "id": 10,
        "name": "Місо суп",
        "description": "Японський суп на основі соєвого соусу з тофу, водоростями і зеленим луком.",
        "price": 90,
    },
    {
        "id": 11,
        "name": "Стейк з яловичини",
        "description": "Стейк з яловичини з картоплею фрі та соусом.",
        "price": 200,
    },
    {
        "id": 12,
        "name": "Лосось гриль",
        "description": "Філе лосося гриль з овочами на пару та лимонним соусом.",
        "price": 180,
    },
    {
        "id": 13,
        "name": "Кальмари фрі",
        "description": "Кальмари фрі з лимоном і соусом тартар.",
        "price": 110,
    },
    {
        "id": 14,
        "name": "Креветки на мангалі",
        "description": "Креветки на мангалі з часником, лимоном і зеленим луком.",
        "price": 150,
    },
    {
        "id": 15,
        "name": "Чізкейк Нью-Йорк",
        "description": "Чізкейк зі сметановим кремом та фруктовим соусом.",
        "price": 80,
    },
    {
        "id": 16,
        "name": "Морквяний торт",
        "description": "Морквяний торт з глазур'ю з вершків і горіхами.",
        "price": 70,
    },
    {
        "id": 17,
        "name": "Шоколадний фондан",
        "description": "Шоколадний десерт із рідким серцем, подається з морозивом.",
        "price": 90,
    },
    {
        "id": 18,
        "name": "Італійський гелато",
        "description": "Вибір італійських морозива: ванільне, шоколадне, фруктове.",
        "price": 60,
    },
    {
        "id": 19,
        "name": "Тірамісу",
        "description": "Класичний італійський десерт з маскарпоне, кавою та ладшими бісквітами.",
        "price": 60,
    },
    {
        "id": 20,
        "name": "Фруктовий салат",
        "description": "Салат з сезонних фруктів і ягід, политий фруктовим сиропом.",
        "price": 50,
    }
]


def index(request):
    return render(request, "products/index.html")

def products(request):
    return render(request, "products/products.html", {
        "products": products_list
    })

def product(request, productId):
    for item in products_list:
        if item["id"] == productId:
            return render(request, 'products/product.html',
        {'product': item})